<!-- html部分 -->
<template>
	<div style="text-align: center;">
		<h1>企业能耗比对比图</h1>
		<ve-line :data="chartData1"></ve-line>
		<h1>企业作业量对比图</h1>、
		<ve-histogram :data="chartData2"></ve-histogram>
	</div>
</template>
<!-- js部分 -->
<script>
	export default {
		name:'',
		data() {
			return {
				chartData1: {
				  columns: ['日期', '周口港', '上海港', '连云港'],
					  rows: [
						{ '日期': '1月', '周口港': 93, '上海港': 73, '连云港': 32 },
						{ '日期': '2月', '周口港':30, '上海港': 30, '连云港': 26 },
						{ '日期': '3月', '周口港': 23, '上海港': 23, '连云港': 76 },
						{ '日期': '4月', '周口港': 23, '上海港': 83, '连云港': 49 },
						{ '日期': '5月', '周口港': 92, '上海港': 92, '连云港': 33 },
						{ '日期': '6月', '周口港': 93, '上海港': 83, '连云港': 78 },
					  ]
				},
				chartData2: {
				  columns: ['日期', '周口港', '上海港', '连云港'],
					  rows: [
						{ '日期': '1月', '周口港': 193, '上海港': 173, '连云港': 132 },
						{ '日期': '2月', '周口港':130, '上海港': 130, '连云港': 126 },
						{ '日期': '3月', '周口港': 123, '上海港': 123, '连云港': 176 },
						{ '日期': '4月', '周口港': 123, '上海港': 183, '连云港': 149 },
						{ '日期': '5月', '周口港': 192, '上海港': 192, '连云港': 133 },
						{ '日期': '6月', '周口港': 193, '上海港': 183, '连云港': 178 }
					  ]
				}
			}
		},
		methods:{
			
		}
	}
</script>
<!-- css部分 -->
<style>

</style>
